{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      { "SpecialToken": { "id": "<s>", "type_id": 0 } },
      { "Sequence": { "id": "A", "type_id": 0 } }
    ],
    "pair": [
      { "SpecialToken": { "id": "<s>", "type_id": 0 } },
      { "Sequence": { "id": "A", "type_id": 0 } },
      { "Sequence": { "id": "B", "type_id": 1 } }
    ],
    "special_tokens": {
      "<s>": { "id": "<s>", "ids": [0], "tokens": ["<s>"] }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<s>": 0,
      "hello": 1,
      "world": 2,
      "[UNK]": 3
    },
    "unk_token": "[UNK]"
  }
}
